import java.util.Scanner;

//Реализуйте простой справочник по командам Java. На вход подаётся команда, по которой необходима справка (ограничимся тремя командами). В соответствии с этим выведите текст:
//
//Ввод: System.out.println()
//
//Вывод: Это команда вывода на печать
//
//Ввод: if
//
//Вывод: Это условный оператор
//
//Ввод: else
//
//Вывод: Это альтернативная конструкция условного оператора
//
//
//
//Если введено что-либо другое, выведите фразу "Раздел в разработке" (без кавычек).
//3.4.5
//class MyProgram {
//    public static void main(String[] args) {
//        Scanner sc = new Scanner(System.in);
//        String x = sc.nextLine();
//        switch (x) {
//            case "System.out.println()":
//                System.out.print("Это команда вывода на печать");
//                break;
//            case "if":
//                System.out.print("Это условный оператор");
//                break;
//            case "else":
//                System.out.print("Это альтернативная конструкция условного оператора");
//                break;
//            default:
//                System.out.print("Раздел в разработке");
//        }
//    }
//}